# Практические задания главы 3 «Основы Python»

## Задание 1

Напишите программу, в которой бы соединялись ваши имя и фамилия. Между ними должен быть пробел.

**Решение**


```python
" ".join(["Владимир", "Салтыков"])
```




    'Владимир Салтыков'



## Задание 2

Прямоугольник имеет длину `l` (англ. буква *l*) и высоту `h`. Напишите код для вычисления площади прямоугольника с высотой 8 и длиной 23. В коде должно быть присвоение значений переменным `l` и `h`, чтобы один и тот же код можно было использовать повторно. Для вычисления площади прямоугольника нужно его длину умножить на высоту.

**Решение**


```python
l = 23
h = 8

l * h
```




    184



## Задание 3

Чему равен квадрат числа 32 и куб числа 27? Напишите оператор, который ответит на этот вопрос.

**Решение**


```python
print(32 ** 2)
print(27 ** 3)
```

    1024
    19683
    

## Задание 4

Напишите приведенное ниже уравнение на Python. Присвойте числовые значения переменным и вычислите результат.

$(a + b)^2 = a^2 + b^2 + 2ab$

**Решение**


```python
a = 1
b = 2

print((a + b) ** 2)
print(a ** 2 + b ** 2 + 2 * a * b)
```

    9
    9
    

## Задание 5

Найдите длину своего имени, написав однострочный код на Python.

**Решение**


```python
len("Владимир")
```




    8



## Задание 6

Нарисуйте прямоугольник, используя функцию `print()`.

**Решение**


```python
l = 7
h = 3
real_l = l * 2

print(f"+{'-' * real_l}+")
for i in range(h):
    print(f"|{' ' * real_l}|")
print(f"+{'-' * real_l}+")
```

    +--------------+
    |              |
    |              |
    |              |
    +--------------+
    

## Задание 7

Нарисуйте букву `P` с помощью простейшей геометрии и функции `print()`.

**Решение**


```python
print("       _______________")
print("      /    _____     /")
print("     /    /    /    / ")
print("    /    /____/    /  ")
print("   /     _________/   ")
print("  /     /             ")
print(" /     /              ")
print("/_____/               ")
```

           _______________
          /    _____     /
         /    /    /    / 
        /    /____/    /  
       /     _________/   
      /     /             
     /     /              
    /_____/               
    

## Задание 8

Создайте переменную `name` и присвойте ей свое имя. Переменной `age` присвойте свой возраст. Затем напишите оператор `print()`, который выведет текст «`Меня зовут name, а мой возраст - age`», с подставленными значениями выших переменных. Значения `name` и `age` должны быть строкой и числом соответственно.

**Решение**


```python
name = "Владимир"
age = 31

print(f"Меня зовут {name}, а мой возраст - {age}")
```

    Меня зовут Владимир, а мой возраст - 31
    

## Задание 9

Исправьте синтаксическую ошибку в следующих строках кода:
```
words = [cat, window, defenestrate]
for w in words:
    print(w, len(w))
```

**Решение**


```python
words = ["cat", "window", "defenestrate"]
for w in words:
    print(w, len(w))
```

    cat 3
    window 6
    defenestrate 12
    

## Задание 10

Исправьте синтаксическую ошибку в следующих строках кода:
```
a, b = 0, 1
while a < 15:
print(a, end=',')
a, b = b, a + b
```

**Решение**


```python
a, b = 0, 1
while a < 15:
    print(a, end=',')
    a, b = b, a + b
```

    0,1,1,2,3,5,8,13,
