# Практические задания главы 5 «Операторы управления потоком»

## Задание 1

Трейдер хочет, чтобы программа проверяла, получил ли он прибыль или убыток по сделке. Напишите программу в которой с клавиатуры вводится цена покупки и продажи, а в ответ программа сообщает, получил ли трейдер прибыль или убыток. Программа также должна рассчитать суммы прибыли или убытка.

**Решение**


```python
buy_price = float(input("Цена покупки: "))
sale_price = float(input("Цена продажи: "))

if buy_price > sale_price:
    print(f"Трейдер получил убыток в размере {buy_price - sale_price}")
else:
    print(f"Трейдер получил прибыль в размере {sale_price - buy_price}")
```

    Цена покупки: 100
    Цена продажи: 555
    Трейдер получил прибыль в размере 455.0
    

## Задание 2

Напишите программу, которая проверяет, является ли год, введенный с клавиатуры, високосным.

**Решение**


```python
year = int(input("Год: "))
if (year % 4 == 0) and (year % 100 != 0) or (year % 400 == 0):
    print(f"Год {year} високосный")
else:
    print(f"Год {year} невисокосный")
```

    Год: 2022
    Год 2022 невисокосный
    

## Задание 3

Трое сотрудников, Самир, Правин и Мохит, вводят свой опыт работы с клавиатуры. Напишите программу, которая определяет наиболее и наименее опытного из них.

**Решение**


```python
emploies = dict()

emploies["Самир"] = int(input("Опыт работы Самира: "))
emploies["Правин"] = int(input("Опыт работы Правина: "))
emploies["Мохит"] = int(input("Опыт работы Мохита: "))

print(f"Самый опытный - {max(emploies.items(), key=lambda t: t[1])[0]}")
print(f"Самый неопытный - {min(emploies.items(), key=lambda t: t[1])[0]}")
```

    Опыт работы Самира: 10
    Опыт работы Правина: 3
    Опыт работы Мохита: 15
    Самый опытный - Мохит
    Самый неопытный - Правин
    

## Задание 4

Сумма трех углов треугольника составляет 180 градусов. Напишите программу, которая проверяет, является ли фигура треугольником, если в качестве входных данных вводятся три угла.

**Решение**


```python
a = int(input("Угол a: "))
b = int(input("Угол b: "))
c = int(input("Угол c: "))

if a > 0 and b > 0 and c > 0 and sum([a, b ,c]) == 180:
    print("Треугольник")
else:
    print("Не треугольник")
```

    Угол a: 60
    Угол b: 60
    Угол c: 60
    Треугольник
    

## Задание 5

Даны три угла треугольника. Напишите программу, которая проверит, является ли он прямоугольным (один из углов должен составлять 90 градусов).

**Решение**


```python
a = int(input("Угол a: "))
b = int(input("Угол b: "))
c = int(input("Угол c: "))

if a > 0 and b > 0 and c > 0 and sum([a, b ,c]) == 180:
    if a == 90 or b == 90 or c == 90:
        print("Прямоугольный треугольник")
    else:
        print("Не прямоугольный треугольник")
else:
    print("Не треугольник")
```

    Угол a: 90
    Угол b: 60
    Угол c: 30
    Прямоугольный треугольник
    

## Задание 6

Сколько разных трехзначных чисел можно получить, используя цифры 1, 2 и 3 в разных позициях? Напишите программу для генерации всех таких чисел (подсказка: используйте цикл `for`).

**Решение**


```python
len([f"{i}{j}{k}" for i in range(1, 4) for j in range(1, 4) for k in range(1, 4)])
```




    27



## Задание 7

Напишите код для вывода таблицы умножения любого заданного числа.

**Решение**


```python
num = int(input("Число: "))

if num < 2 or num > 9:
    raise ValueError("Таблица умножения строится только для чисел в диапазоне [2; 9]")
    
for i in range(2, 10):
    print(f"{num} * {i} = {num * i}")
```

    Число: 9
    9 * 2 = 18
    9 * 3 = 27
    9 * 4 = 36
    9 * 5 = 45
    9 * 6 = 54
    9 * 7 = 63
    9 * 8 = 72
    9 * 9 = 81
    

## Задание 8

Напишите программу для вывода всех простых чисел от 1 до 500.

**Решение**


```python
def simple_nums(a, b):
    for i in range(a, b + 1):
        if i == 1:
            continue

        deviders = 0
        for j in range(1, i + 1):
            if i % j == 0:
                deviders += 1

        if deviders == 2:
            yield i
            
print(", ".join(str(x) for x in simple_nums(1, 500)))
```

    2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499
    

## Задание 9

Выведите все числа, краные 9, которые меньше 300 (подсказка: вы можете использовать функцию `range()`).

**Решение**


```python
def nums():
    for i in range(301):
        if i % 9 == 0:
            yield i
            
print(", ".join(str(x) for x in nums()))
```

    0, 9, 18, 27, 36, 45, 54, 63, 72, 81, 90, 99, 108, 117, 126, 135, 144, 153, 162, 171, 180, 189, 198, 207, 216, 225, 234, 243, 252, 261, 270, 279, 288, 297
    

## Задание 10

Машина в течение срока службы приносит годовой доход в размере 200 000 руб. Сама она стоит 1 000 000 руб. в момент покупки и продается за 250 000 руб. при утилизации. Вложив ту же сумму в другие инвестиционные инструменты, можно заработать 8% годовых. Каков минимальный срок службы машины, при котором она станет более привлекательной по сравнению с альтернативными инвестициями?

**Решение**
